{
  "_class_name": "UNetSpatioTemporalConditionModel",
  "_diffusers_version": "0.24.0.dev0",
  "_name_or_path": "/home/suraj_huggingface_co/.cache/huggingface/hub/models--diffusers--svd-xt/snapshots/9703ded20c957c340781ee710b75660826deb487/unet",
  "addition_time_embed_dim": 256,
  "block_out_channels": [
    320,
    640,
    1280,
    1280
  ],
  "cross_attention_dim": 1024,
  "down_block_types": [
    "CrossAttnDownBlockSpatioTemporal",
    "CrossAttnDownBlockSpatioTemporal",
    "CrossAttnDownBlockSpatioTemporal",
    "DownBlockSpatioTemporal"
  ],
  "in_channels": 8,
  "layers_per_block": 2,
  "num_attention_heads": [
    5,
    10,
    20,
    20
  ],
  "num_frames": 25,
  "out_channels": 4,
  "projection_class_embeddings_input_dim": 768,
  "sample_size": 96,
  "transformer_layers_per_block": 1,
  "up_block_types": [
    "UpBlockSpatioTemporal",
    "CrossAttnUpBlockSpatioTemporal",
    "CrossAttnUpBlockSpatioTemporal",
    "CrossAttnUpBlockSpatioTemporal"
  ]
}
